# @title Help
@staticmethod
def Help():
    print(textwrap.dedent
     ('''
    중요 : 함수에 설명에 대한 설명 
    예)
        컬럼 드랍 : Get_DropColms(_df: pd.DataFrame, _dropColms: list = [])->pd.DataFrame:  <- 반환형은 어떤 형식인지 이렇게 표시됩니다. 이 경우는 df입니다.
                    설명) _dropColms 리스트에 df컬럼에 동일한 컬럼이 없어도 지금 있는 컬럼만 제거하고 안전하게 반환합니다. 
                    인자) 
                        _dropColms: list = [] <- ['이름','나이','혈액형']으로 들어가면 

                    반환) 리스트에 있는 컬럼을 제거하고 남은 df 반환


        인자로서의 df에 대한 설명은 생략하겠습니다. 
        이런식으로 작성되면 함수 인자에 **이 찍힌 것은 인자에 반드시 있어야 하는 것 입니다.
    
    ----------------------------------------------------------------

    접미의 Get_ 은 반환이 있다는 뜻입니다.
    접미의 Set_ 은 반환 없이 무언가를 설정하겠다는 것입니다. (정적 유틸리티라 거의 없음.)
    접미의 Draw_ 시각화 함수입니다. 반환이 없습니다.

    ----------------------------------------------------------------

    EesyPanda : 판다스 관련
    InitPrj : 프로젝트 초기 셋팅 관련
    Data_Prep : 데이터 전처리 관련
    Draw : 시각화 관련
    Feature_Selection :  피쳐 선택 관련
    Feature_Engineering : 피쳐 엔지니어링 관련
    Sampling : 샘플링 관련 오버 셈플링 언더 셈플링. 혹은 노이즈추가
    Modeling : 머신 모델링 관련

    ----------------------------------------------------------------

    전체 사용법은 HelpOverView() 호출

    개별 클래스 별로 사용볍 
        예) EasyPand.Help() 호출 
    '''))
    pass

@staticmethod
def HelpOverView():
    EasyPanda.Help()
    print()
    print('==================================================================================================================================================')
    print()
    InitPrj.Help()
    print()
    print('==================================================================================================================================================')
    print()
    Data_Prep.Help()
    print()
    print('==================================================================================================================================================')
    print()
    Draw.Help()
    print()
    print('==================================================================================================================================================')
    print()
    Feature_Selection.Help()
    print()
    print('==================================================================================================================================================')
    print()
    Feature_Engineering.Help()
    print()
    print('==================================================================================================================================================')
    print()
    Sampling.Help()
    print()
    print('==================================================================================================================================================')
    print()
    Modeling.Help()
    print()
    print('==================================================================================================================================================')
    print()
    pass